In [35]:
# data analysis,EDA and visaualization
import pandas as pd
import os
import warnings
warnings.filterwarnings("ignore")

os.listdir()
df  = pd.read_csv("loan.csv")
display(df.head());print(df.shape)

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,num_tl_90g_dpd_24m,num_tl_op_past_12m,pct_tl_nvr_dlq,percent_bc_gt_75,pub_rec_bankruptcies,tax_liens,tot_hi_cred_lim,total_bal_ex_mort,total_bc_limit,total_il_high_credit_limit
0,1077501,1296599,5000,5000,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
1,1077430,1314167,2500,2500,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
2,1077175,1313524,2400,2400,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
3,1076863,1277178,10000,10000,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
4,1075358,1311748,3000,3000,3000.0,60 months,12.69%,67.79,B,B5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN

(39717, 111)

In [51]:
print(list(df.columns))
needed = ["loan_status",'loan_amnt','term', 'int_rate','emp_title', 'emp_length', 'home_ownership', 'annual_inc',"purpose","title"]
dt = df[needed];print(dt.shape)
dt.head()

['id', 'member_id', 'loan_amnt', 'funded_amnt', 'funded_amnt_inv', 'term', 'int_rate', 'installment', 'grade', 'sub_grade', 'emp_title', 'emp_length', 'home_ownership', 'annual_inc', 'verification_status', 'issue_d', 'loan_status', 'pymnt_plan', 'url', 'desc', 'purpose', 'title', 'zip_code', 'addr_state', 'dti', 'delinq_2yrs', 'earliest_cr_line', 'inq_last_6mths', 'mths_since_last_delinq', 'mths_since_last_record', 'open_acc', 'pub_rec', 'revol_bal', 'revol_util', 'total_acc', 'initial_list_status', 'out_prncp', 'out_prncp_inv', 'total_pymnt', 'total_pymnt_inv', 'total_rec_prncp', 'total_rec_int', 'total_rec_late_fee', 'recoveries', 'collection_recovery_fee', 'last_pymnt_d', 'last_pymnt_amnt', 'next_pymnt_d', 'last_credit_pull_d', 'collections_12_mths_ex_med', 'mths_since_last_major_derog', 'policy_code', 'application_type', 'annual_inc_joint', 'dti_joint', 'verification_status_joint', 'acc_now_delinq', 'tot_coll_amt', 'tot_cur_bal', 'open_acc_6m', 'open_il_6m', 'open_il_12m', 'open_il_24m', 'mths_since_rcnt_il', 'total_bal_il', 'il_util', 'open_rv_12m', 'open_rv_24m', 'max_bal_bc', 'all_util', 'total_rev_hi_lim', 'inq_fi', 'total_cu_tl', 'inq_last_12m', 'acc_open_past_24mths', 'avg_cur_bal', 'bc_open_to_buy', 'bc_util', 'chargeoff_within_12_mths', 'delinq_amnt', 'mo_sin_old_il_acct', 'mo_sin_old_rev_tl_op', 'mo_sin_rcnt_rev_tl_op', 'mo_sin_rcnt_tl', 'mort_acc', 'mths_since_recent_bc', 'mths_since_recent_bc_dlq', 'mths_since_recent_inq', 'mths_since_recent_revol_delinq', 'num_accts_ever_120_pd', 'num_actv_bc_tl', 'num_actv_rev_tl', 'num_bc_sats', 'num_bc_tl', 'num_il_tl', 'num_op_rev_tl', 'num_rev_accts', 'num_rev_tl_bal_gt_0', 'num_sats', 'num_tl_120dpd_2m', 'num_tl_30dpd', 'num_tl_90g_dpd_24m', 'num_tl_op_past_12m', 'pct_tl_nvr_dlq', 'percent_bc_gt_75', 'pub_rec_bankruptcies', 'tax_liens', 'tot_hi_cred_lim', 'total_bal_ex_mort', 'total_bc_limit', 'total_il_high_credit_limit']
(39717, 10)

,loan_status,loan_amnt,term,int_rate,emp_title,emp_length,home_ownership,annual_inc,purpose,title
0,Fully Paid,5000,36 months,10.65%,NaN,10+ years,RENT,24000.0,credit_card,Computer
1,Charged Off,2500,60 months,15.27%,Ryder,< 1 year,RENT,30000.0,car,bike
2,Fully Paid,2400,36 months,15.96%,NaN,10+ years,RENT,12252.0,small_business,real estate business
3,Fully Paid,10000,36 months,13.49%,AIR RESOURCES BOARD,10+ years,RENT,49200.0,other,personel
4,Current,3000,60 months,12.69%,University Medical Group,1 year,RENT,80000.0,other,Personal

In [52]:
cleanInterest = []
for i in dt['int_rate']:
    x = i.replace("%","")
    x = float(x)
    cleanInterest.append(x)
dt["InterestRatesClean"] = cleanInterest
dt = dt.drop("int_rate",axis = 1)
dt.head(2)

,loan_status,loan_amnt,term,emp_title,emp_length,home_ownership,annual_inc,purpose,title,InterestRatesClean
0,Fully Paid,5000,36 months,NaN,10+ years,RENT,24000.0,credit_card,Computer,10.65
1,Charged Off,2500,60 months,Ryder,< 1 year,RENT,30000.0,car,bike,15.27

In [53]:
clean_year = []
for i in dt['emp_length']:
    x = str(i).replace("years","").replace("year","").replace("< 1","0.5").replace("+","")
    x = float(x) * 12
    clean_year.append(x)

dt = dt.drop("emp_length",axis = 1)
dt['empInMonths'] = clean_year
dt.head()

,loan_status,loan_amnt,term,emp_title,home_ownership,annual_inc,purpose,title,InterestRatesClean,empInMonths
0,Fully Paid,5000,36 months,NaN,RENT,24000.0,credit_card,Computer,10.65,120.0
1,Charged Off,2500,60 months,Ryder,RENT,30000.0,car,bike,15.27,6.0
2,Fully Paid,2400,36 months,NaN,RENT,12252.0,small_business,real estate business,15.96,120.0
3,Fully Paid,10000,36 months,AIR RESOURCES BOARD,RENT,49200.0,other,personel,13.49,120.0
4,Current,3000,60 months,University Medical Group,RENT,80000.0,other,Personal,12.69,12.0

In [54]:
dt['loan_status'].value_counts()

loan_status
Fully Paid     32950
Charged Off     5627
Current         1140
Name: count, dtype: int64

In [56]:
# get a counter
freq = {}
for i in dt['loan_status']:
    if i not in freq:
        freq[i] = 1
    else:
        freq[i]+=1

In [59]:
df.groupby(['loan_status'])['id'].agg('count')

loan_status
Charged Off     5627
Current         1140
Fully Paid     32950
Name: id, dtype: int64

In [72]:
strings = ['john',"john","akeem","akeem","akeem"]
def mode(strings):
    freq = {}
    for i in strings:
        if i not in freq:
            freq[i] = 1
        else:
            freq[i]+=1
    d = 0
    empty = []
    for i,j in zip(freq.keys(),freq.values()):
        if j>d:
            empty.append(i)
            print(empty)
            d =j
        else:
            pass
    return empty[-1]

import random
names = [random.choice(['john',"akeem","newton"]) for i in range(100)]

In [73]:
mode(names)

['john']
['john', 'akeem']

'akeem'

In [76]:
dt.groupby('loan_status').agg(mode)

[2500]
[2500, 9000]
[2500, 9000, 10000]
[3000]
[3000, 10000]
[3000, 10000, 14000]
[3000, 10000, 14000, 16000]
[3000, 10000, 14000, 16000, 20000]
[5000]
[5000, 10000]
[' 60 months']
[' 60 months', ' 36 months']
[' 60 months']
[' 36 months']
['Ryder']
['Ryder', nan]
['University Medical Group']
['University Medical Group', 'Lockheed Martin']
['University Medical Group', 'Lockheed Martin', nan]
[nan]
['RENT']
['RENT']
['RENT', 'MORTGAGE']
['RENT']
[30000.0]
[30000.0, 40000.0]
[30000.0, 40000.0, 60000.0]
[80000.0]
[80000.0, 50000.0]
[80000.0, 50000.0, 60000.0]
[24000.0]
[24000.0, 36000.0]
[24000.0, 36000.0, 48000.0]
[24000.0, 36000.0, 48000.0, 75000.0]
[24000.0, 36000.0, 48000.0, 75000.0, 50000.0]
[24000.0, 36000.0, 48000.0, 75000.0, 50000.0, 60000.0]
['car']
['car', 'small_business']
['car', 'small_business', 'other']
['car', 'small_business', 'other', 'debt_consolidation']
['other']
['other', 'debt_consolidation']
['credit_card']
['credit_card', 'debt_consolidation']
['bike']
['bike', 'freedom']
['bike', 'freedom', 'Other Loan']
['bike', 'freedom', 'Other Loan', 'consolidation']
['bike', 'freedom', 'Other Loan', 'consolidation', 'Debt Consolidation Loan']
['bike', 'freedom', 'Other Loan', 'consolidation', 'Debt Consolidation Loan', 'Debt Consolidation']
['Personal']
['Personal', 'Consolidation']
['Personal', 'Consolidation', 'Debt Consolidation Loan']
['Computer']
['Computer', 'Loan']
['Computer', 'Loan', 'Consolidation']
['Computer', 'Loan', 'Consolidation', 'Debt Consolidation Loan']
['Computer', 'Loan', 'Consolidation', 'Debt Consolidation Loan', 'Debt Consolidation']
[15.27]
[15.27, 12.69]
[15.27, 12.69, 13.49]
[12.69]
[12.69, 13.49]
[10.65]
[10.65, 13.49]
[10.65, 13.49, 7.51]
[10.65, 13.49, 7.51, 10.99]
[6.0]
[6.0, 120.0]
[12.0]
[12.0, 24.0]
[12.0, 24.0, 120.0]
[120.0]

,loan_amnt,term,emp_title,home_ownership,annual_inc,purpose,title,InterestRatesClean,empInMonths
loan_status,,,,,,,,,
Charged Off,10000,36 months,NaN,RENT,60000.0,debt_consolidation,Debt Consolidation,13.49,120.0
Current,20000,60 months,NaN,MORTGAGE,60000.0,debt_consolidation,Debt Consolidation Loan,13.49,120.0
Fully Paid,10000,36 months,NaN,RENT,60000.0,debt_consolidation,Debt Consolidation,10.99,120.0